public class Main {
    public static void main(String[] args) {
        System.out.println(12345);
    }


}
// 1. приготовить яичницу
    // открыть холодильник
    // if (яйца == есть в наличии) {
    // берем яйцо;
    // разогреваем сковородку;
    // наливаем масло;
    // разбиваем яйцо;
    // жарим яичницу;
    // }
    // else
    // if (яйца != есть в наличии) {
        // просим мужа сходить в магазин;
            // if (муж не хочет == true) {
            // заказываем доставку;
            // if (сумма заказа < 50 рублей) {
            // добавляем товаров до 50 рублей;
            // ждем доставку;
            // берем яйцо;
            // разогреваем сковородку;
            // наливаем масло;
            // разбиваем яйцо;
            // жарим яичницу;
            // }
        // }
    // }
    // Результат: готовая яичница!


// 2. постирать одежду в стиральной машине
    // сортируем одежду;
    // if (стираем белое белье == true) {
    // отбираем белое белье;
    // кладем в стиральную машину;
    // добавляем моющее средство;
        // if (моющее средство == жидкое) {
        // наливаем в специальный отсек;
        // } else {
        // switch (вид моющего средства) {
            // case (порошок):
                // засыпаем порошок в специальный отсек;
                // break;
            // case (капсула):
                // кладем капсулу в барабан;
                // break;
            // }
    // закрываем дверку;
    // выбираем нужную программу;
    // нажимаем пуск;
    // }
    // Результат: постиранное белье!


// 3. помыть окно
    // посмотреть на окно;
    // if (окно == чистое) {
    // не моем окно;
    // } else {
        // if (окно != чистое) {
        // берем чистящее средство;
        // берем тряпку;
        // моем окно изнутри;
            // if (погода == холодно) {
            // не моем окно снаружи;
            // } else {
                // if (погода != холодно) {
                // моем окно снаружи;
                // }
            // }
        // }
        // Результат: чистое окно!


// 4. выключение компьютера
// закрываем все файлы и приложения;
    // if (все файлы сохранены == true) {
    // нажимаем выключение;
    // } else {
        // if (все файлы сохранены != true) {
        // сохраняем все файлы;
        // нажимаем выключение;
            // if (установить обновления == true) {
            // нажимаем установить обновления и завершить работу;
            // } else {
                // нажимаем завершение работы;
                // }
            // }
        // }
        // Результат: компьютер выключен!


// 5. покормить собаку
// берем миску;
    // if ( собака на сухом корме == true) {
    // берем сухой корм;
    // отмеряем нужное количество;
    // насыпаем в миску;
        // } else {
        // if ( собака на натуральном корме == true) {
        // switch (вид еды) {
            // case (каша и мясо):
                // варим кашу;
                // варим мясо;
                // смешиваем;
                // остужаем;
                // break;
            // case (каша и вареная колбаса):
                // варим кашу;
                // режим колбасу;
                // смешиваем;
                // остужаем;
                // break;
                // }
            // даем миску собаке;
        // }
    // }
    // Результат: сытая и довольная собака!


// 6. едем на работу на автобусе
// бежим на остановку ко времения прибытия автобуса;
    // if ( атобус приходит вовремя == true) {
    // садимся на автобус;
    // } else {
        // if (автобус опаздывает == true) {
        // ждем прибытия автобуса;
        // садимся на автобус;
            // if (автобус не приходит == true) {
            // ждем до максимально возможного времения;
            // бежим на маршрутку;
            // садимся в маршрутку;
            // оплачиваме проезд;
            // едем на работу;
            // }
        // }
    // }
    // Результат: успеваем на работу вовремя!

// 7. оформление письменного ответа клиенту
// получаем запрос от клиента;
    // if (знаем ответ == true) {
    // оформляем ответ;
        // } else {
            // if (знаем ответ != true) {
            // разговариваем с тем кто знает;
            // оформляем ответ;
            // подписываем у начальника;
            // отдаем на регистрацию;
                // if (письмо отправить почтой == true) {
                // отдаем письмо на отправку почтой;
                    // } else {
                        // if (письмо оправить по электронной почте == true) {
                        // забираем письмо после регистрации;
                        // сканируем;
                        // отправляем по электронной почте;
                        // }
                    // }
                // }
            //}
            // Результат: клиент получил ответ!





